---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalDefinition
source: html/95023d67-0d09-f788-c911-50e2da001e13.htm
---
# ExternalDefinition Methods

Gets a ForgeTypeId identifying the data type describing values of the parameter.